Autodesk.Revit.DB.SiteInsertServiceData.CreateLinkInstanceOnly
Determines whether to create a linked symbol element or not.
Remarks:
If this value is false (default), we will create a linked symbol and instance.
If this value is true, then we will re-use an existing linked symbol file and create an instance only.
The intention is for CreateLinkInstanceOnly to be true when we are trying to create a new link, when the link already exists in the host file.
Since:
2018

Autodesk.Revit.DB.SiteInsertServiceData.RevitLinkFileName
The full path of the intermediate Revit file created during a previous link action.
This is used during "Reload From" to determine the path to the previous generated Revit file.
Since:
2018

Autodesk.Revit.DB.SiteInsertServiceData.AutoPlace
Indicates whether to auto place the linked symbol element or manually.
Since:
2018

Autodesk.Revit.DB.SiteInsertServiceData.CustomScale
Scaling the linked symbol element.
If this is defined and a valid value (> 0.0), it takes preference over units.
Since:
2018

Autodesk.Revit.DB.SiteInsertServiceData.Unit
The unit of measure for linked symbol element.
Remarks:
Units are used to calculate the import scale unless scale is defined explicitly using CustomScale, in which case Units will be ignored.
Feet, inches, meters, centimeters, decimeters, millimeters are all supported. If Default unit is set, Revit will read and use the units from the file. If units are not available or accessible there, Revit will default to inches.
Since:
2018